RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_usart.h
/* enable or disable USART interrupt */
typedef enum
{
    /* interrupt in CTL0 register */
    USART_INT_AM1 = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 31U),          /*!< address 1 match interrupt */
    USART_INT_EB = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 27U),           /*!< end of block interrupt */
    USART_INT_RT = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 26U),           /*!< receiver timeout interrupt */
    USART_INT_AM0 = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 14U),          /*!< address 0 match interrupt */
    USART_INT_PERR = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 8U),          /*!< parity error interrupt */
    USART_INT_TBE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 7U),           /*!< transmitter buffer empty interrupt(when FIFO is disabled) */
    USART_INT_TFNF = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 7U),          /*!< transmit FIFO not full interrupt(when FIFO is enabled) */
    USART_INT_TC = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 6U),            /*!< transmission complete interrupt */
    USART_INT_RBNE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 5U),          /*!< read data buffer not empty interrupt and overrun error interrupt(when FIFO is disabled) */
    USART_INT_RFNE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 5U),          /*!< receive FIFO not empty interrupt and overrun error interrupt(when FIFO is enabled) */
    USART_INT_IDLE = USART_REGIDX_BIT(USART_CTL0_REG_OFFSET, 4U),          /*!< IDLE line detected interrupt */
    /* interrupt in CTL1 register */
    USART_INT_LBD = USART_REGIDX_BIT(USART_CTL1_REG_OFFSET, 6U),           /*!< LIN break detected interrupt */
    /* interrupt in CTL2 register */
    USART_INT_WU = USART_REGIDX_BIT(USART_CTL2_REG_OFFSET, 22U),           /*!< wakeup from deep-sleep mode interrupt */
    USART_INT_CTS = USART_REGIDX_BIT(USART_CTL2_REG_OFFSET, 10U),          /*!< CTS interrupt */
    USART_INT_ERR = USART_REGIDX_BIT(USART_CTL2_REG_OFFSET, 0U),           /*!< error interrupt */
    /* interrupt in FCS register */
    USART_INT_TFE = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 31U),           /*!< transmit FIFO empty interrupt */
    USART_INT_TFT = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 29U),           /*!< transmit FIFO threshold interrupt */
    USART_INT_RFT = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 27U),           /*!< receive FIFO threshold interrupt */
    USART_INT_RFF = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 9U)             /*!< receive FIFO full interrupt */
}usart_interrupt_enum;

/* configure USART invert */
typedef enum {
    /* data bit level inversion */
    USART_DINV_ENABLE,                                                     /*!< data bit level inversion */
    USART_DINV_DISABLE,                                                    /*!< data bit level not inversion */
    /* TX pin level inversion */
    USART_TXPIN_ENABLE,                                                    /*!< TX pin level inversion */
    USART_TXPIN_DISABLE,                                                   /*!< TX pin level not inversion */
    /* RX pin level inversion */
    USART_RXPIN_ENABLE,                                                    /*!< RX pin level inversion */
    USART_RXPIN_DISABLE,                                                   /*!< RX pin level not inversion */
    /* swap TX/RX pins */
    USART_SWAP_ENABLE,                                                     /*!< swap TX/RX pins */
    USART_SWAP_DISABLE                                                     /*!< not swap TX/RX pins */
}usart_invert_enum;

/* configure USART receiver */
#define CTL0_REN(regval)              (BIT(2) & ((uint32_t)(regval) << 2))
#define USART_RECEIVE_ENABLE          CTL0_REN(1)                          /*!< enable receiver */
#define USART_RECEIVE_DISABLE         CTL0_REN(0)                          /*!< disable receiver */

/* configure USART transmitter */
#define CTL0_TEN(regval)              (BIT(3) & ((uint32_t)(regval) << 3))
#define USART_TRANSMIT_ENABLE         CTL0_TEN(1)                          /*!< enable transmitter */
#define USART_TRANSMIT_DISABLE        CTL0_TEN(0)                          /*!< disable transmitter */

/* USART parity bits definitions */
#define CTL0_PM(regval)               (BITS(9,10) & ((uint32_t)(regval) << 9))
#define USART_PM_NONE                 CTL0_PM(0)                           /*!< no parity */
#define USART_PM_EVEN                 CTL0_PM(2)                           /*!< even parity */
#define USART_PM_ODD                  CTL0_PM(3)                           /*!< odd parity */

/* USART wakeup method in mute mode */
#define CTL0_WM(regval)               (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_WM_IDLE                 CTL0_WM(0)                           /*!< idle line */
#define USART_WM_ADDR                 CTL0_WM(1)                           /*!< address match */

/* USART word length definitions */
#define CTL0_WL(regval1, regval2)     ((BIT(28) & ((uint32_t)(regval1) << 28)) | (BIT(12) & ((uint32_t)(regval2) << 12)))
#define USART_WL_8BIT                 CTL0_WL(0, 0)                        /*!< 8 bits */
#define USART_WL_9BIT                 CTL0_WL(0, 1)                        /*!< 9 bits */
#define USART_WL_7BIT                 CTL0_WL(1, 0)                        /*!< 7 bits */
#define USART_WL_10BIT                CTL0_WL(1, 1)                        /*!< 10 bits */

/* USART oversample mode */
#define CTL0_OVSMOD(regval)           (BIT(15) & ((uint32_t)(regval) << 15))
#define USART_OVSMOD_8                CTL0_OVSMOD(1)                       /*!< oversampling by 8 */
#define USART_OVSMOD_16               CTL0_OVSMOD(0)                       /*!< oversampling by 16 */

/* USART LIN break frame length */
#define CTL1_LBLEN(regval)            (BIT(5) & ((uint32_t)(regval) << 5))
#define USART_LBLEN_10B               CTL1_LBLEN(0)                        /*!< 10 bits break detection */
#define USART_LBLEN_11B               CTL1_LBLEN(1)                        /*!< 11 bits break detection */

